import { DIFFICULTIES } from "../../constants/difficulties";
import { LEVELS } from "../../constants/levels";
import type { ReadingTaskGroup } from "../../types/reading";

export const textEasyGroup = {
  id: "texts-easy",
  level: LEVELS.Texts,
  difficulty: DIFFICULTIES.Easy,
  tasks: [
    {
      id: "text-easy-1",
      value: "Дети рады зиме. Идет снег. Коля и Митя бегут домой. Руки зябнут.",
    },
    {
      id: "text-easy-2",
      value:
        "Вася и Юра идут в школу. Оля пишет брату письмо. Он живет в Уфе. Там есть река Белая. Брат часто ловит рыбу.",
    },
    {
      id: "text-easy-3",
      value:
        "В Москве есть река Москва. В Уфе есть река Уфа. Названия городов и рек одинаковы.",
    },
    {
      id: "text-easy-4",
      value: "Папа отвёл Яшу в ясли. Зоя и Валя были в саду. Оля играла в мяч.",
    },
    {
      id: "text-easy-5",
      value: "День ясный. Юра и Сеня гуляют. Вот и речка. За речкой ельник.",
    },
    {
      id: "text-easy-6",
      value:
        "Был мороз. Петя гулял в саду. У Пети зябли уши и нос. Тетя Зина дала теплый шарф.",
    },
    {
      id: "text-easy-7",
      value:
        "Белка живет в дупле. Белка часто выходит из дупла. На зиму белка сушит грибы. В дупле у белки есть шишки.",
    },
    {
      id: "text-easy-8",
      value: "На куст сел воробей. Кот Мурзик уже тут. Прыг! Улетела птичка.",
    },
    {
      id: "text-easy-9",
      value:
        "Тает снег. Дует тёплый ветерок. Звенят быстрые ручейки. Летят с юга птицы.",
    },
    {
      id: "text-easy-10",
      value:
        "Реже светит солнышко. Дует холодный ветер. Часто моросит дождик. Скоро закружит белая метель.",
    },
    {
      id: "text-easy-11",
      value:
        "Закончился летний дождик. Выглянуло солнышко. Заблестел мокрый луг. Над дальним лесом встала радуга.",
    },
    {
      id: "text-easy-12",
      value:
        "Мама пришла с работы. Она варит суп. Света и Паша учат уроки. Дедушка читает книгу.",
    },
    {
      id: "text-easy-13",
      value:
        "Мамы с малышами гуляют в парке. У Светы кукла. У Вани мячик. Дети играют дружно.",
    },
    {
      id: "text-easy-14",
      value:
        "На улице пасмурво. На небе тёмные тучи. Идёт мелкий дождик. Дует сильный ветер. Холодно.",
    },
    {
      id: "text-easy-15",
      value:
        "Сегодня чудесная погода. Ярко светит солнышко. Дима и Артём бегут гулять во двор. Детям весело.",
    },
    {
      id: "text-easy-16",
      value:
        "Опять льёт сильный дождь. Я и братишка Игорь остались дома. В такую погоду нельзя гулять.",
    },
    {
      id: "text-easy-17",
      value:
        "Вечер. Маленький Саша играет в машинки. На стене часы пробили восемь раз. Пopa собирать игрушки. Скоро спать!",
    },
    {
      id: "text-easy-18",
      value:
        "На дворе март. Яркие лучи солнышка стали чуть теплее. Снег на крыше начал таять. Зазвенела первая капель.",
    },
    {
      id: "text-easy-19",
      value:
        "Дети играли в школу. Ольга была учителем. Петя и Света ученики. Они читали букварь. В тетради ребята старательно выводили слоги.",
    },
    {
      id: "text-easy-20",
      value:
        "Ване семь лет. Он идёт в первый класс. В руке Ваня несёт большой букет цветов. В ранце у мальчика книги и тетради.",
    },
    {
      id: "text-easy-21",
      value:
        "Весной в зоопарке родились детёныши. У кроликов появились крольчата. В семье пушистых белочек растут бельчата. В птичьих гнёздах  пищат птенцы.",
    },
    {
      id: "text-easy-22",
      value:
        "В чулане жили мыши. Папа принёс в дом кота. Назвали его Pыжик. Кот ловил мышей. Миша поил Рыжика молоком.",
    },
    {
      id: "text-easy-23",
      value:
        "У Киры день рождения. Родители подарили дочке платье. Бабушка связала носочки. Брат нарисовал для сестры открытку.",
    },
    {
      id: "text-easy-24",
      value:
        "Вечером в лесу особая жизнь. Спешит на охоту колючий ёжик. Ищут добычу рысь и барсук. Мыши станут ужином для совы.",
    },
    {
      id: "text-easy-25",
      value:
        "В огороде созрел урожай овощей. На грядках выросла капуста и морковь. Пopa убирать и картофель. Mы рады щедрому урожаю.",
    },
    {
      id: "text-easy-26",
      value:
        "На вершине ели чиж свил гнездо. Тут на мягкой перинке лежат пять пёетрых яичек. Скоро в гнезде запищат птенцы.",
    },
    {
      id: "text-easy-27",
      value:
        "Липа цветёт летом. Её цветочки маленькие, но душистые. На сладкий запах к дереву летят пчёлы. Липовый мёд вкусный и полезный.",
    },
    {
      id: "text-easy-28",
      value:
        "Холодно. Облетела листва. В воздухе закружились пушистые снежинки. Как они похожи на чудесные цветы! Ковром укрывает землю первый снежок.",
    },
    {
      id: "text-easy-29",
      value:
        "Зимой река спала под толстым льдом. Весной лёд потемнел и стал непрочным. Теперь выходить на тонкий лёд очень опасно.",
    },
    {
      id: "text-easy-30",
      value:
        "У бабушки в саду много цветов. Над яркими цветами летают бабочки и пчёлы. Очепь красиво!",
    },
    {
      id: "text-easy-31",
      value:
        "Олег и Денис идут в лес. Рядом бежит Барбос. Вдруг из кустов вылетел рябчик. Пёс резко залаял. Верный сторож охраняет ребят.",
    },
    {
      id: "text-easy-32",
      value:
        "По дорожке прыгал воробей. Он нашёл крошку хлеба. Воробей взял её в клюв и полетел на чердак. Там его ждали птенцы.",
    },
    {
      id: "text-easy-33",
      value:
        "Узкая тропка вывела нас к тихому озерцу. Его берег зарос мягкой травкой. В синей воде отражались  облачка и дальний лес.",
    },
    {
      id: "text-easy-34",
      value:
        "В лесу настала грибная пopa. Вот под елью крепкий рыжик. Под листом берёзы спрятался груздь. К дорожке выбежали сыроежки. Хороши грибы!",
    },
    {
      id: "text-easy-35",
      value:
        "Дима идёт в первый класс. В портфеле у него учебники и тетради. В пенале ручка и карандаш. Дима держит вещи в порядке.",
    },
    {
      id: "text-easy-36",
      value:
        "Весна. Глеб и Денис ходили на берег реки. Они смотрели на ледоход. На берегу много луж. У Глеба промок сапoг.  Пopa  домой.",
    },
  ],
} satisfies ReadingTaskGroup;
